abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_i2s_driver.c
    baseAddr = g_flexioBase[master->flexioCommon.instance];
    resourceIndex = master->flexioCommon.resourceIndex;

    if (master->txRemainingBytes == 0U)
    {
        /* Done transmitting */
        return;
    }

    /* Read data from user buffer and update tx buffer pointer and remaining bytes count */
    switch (master->byteWidth)
    {
    case 1U:
        data = (uint32_t)(*(uint8_t *)master->txData);
        break;
    case 2U:
        data = (uint32_t)(*(uint16_t *)master->txData);
        break;
    default:
        data = (uint32_t)(*(uint32_t *)master->txData);
        break;
    }
    master->txData += master->byteWidth;
    master->txRemainingBytes -= master->byteWidth;

    /* Write data to shifter buffer */
    /* Shift data before bit-swapping it to get the relevant bits in the lower part of the shifter */
    data <<= 32U - (uint32_t)(master->bitsWidth);
    FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER(resourceIndex), data, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterCheckStatus
 * Description   : Check status of the I2S transfer. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the I2S transfer.
 *
 *END**************************************************************************/
static void FLEXIO_I2S_DRV_MasterCheckStatus(void *stateStruct)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    flexio_i2s_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    master = (flexio_i2s_master_state_t *)stateStruct;
    baseAddr = g_flexioBase[master->flexioCommon.instance];
    resourceIndex = master->flexioCommon.resourceIndex;

    /* Check for errors */
    if ((master->txData != NULL) && FLEXIO_HAL_GetShifterErrorStatus(baseAddr, TX_SHIFTER(resourceIndex)))
    {
        master->status = FLEXIO_STATUS_TX_UNDERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, TX_SHIFTER(resourceIndex));
        /* Continue processing events */
    }
    if ((master->rxData != NULL) && FLEXIO_HAL_GetShifterErrorStatus(baseAddr, RX_SHIFTER(resourceIndex)))
    {
        master->status = FLEXIO_STATUS_RX_OVERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, RX_SHIFTER(resourceIndex));
        /* Continue processing events */
    }
    /* Check if data was received */
    if (FLEXIO_HAL_GetShifterStatus(baseAddr, RX_SHIFTER(resourceIndex)))
    {
        FLEXIO_I2S_DRV_ReadData(master);
        if ((master->rxData != NULL) && (master->rxRemainingBytes == 0U))
        {
            /* Out of rx space, call callback to allow user to provide a new buffer */
            if (master->callback != NULL)
            {
                master->callback(master, FLEXIO_EVENT_RX_FULL, master->callbackParam);
            }
        }
    }
    /* Check if transmitter needs more data */
    if ((master->txData != NULL) && FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER(resourceIndex)))
    {
        FLEXIO_I2S_DRV_WriteData(master);
        if (master->txRemainingBytes == 0U)
        {
            /* Out of data, call callback to allow user to provide a new buffer */
            if (master->callback != NULL)
            {
                master->callback(master, FLEXIO_EVENT_TX_EMPTY, master->callbackParam);
            }
            if (master->txRemainingBytes == 0U)
            {
                /* Still no more data to transmit, transmission will stop */
                if (master->driverType == FLEXIO_DRIVER_TYPE_INTERRUPTS)
                {
                    /* disable tx interrupts */
                    FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
                    FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
                    /* Enable rx interrupt to signal end of transfer */
                    FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << RX_SHIFTER(resourceIndex)), true);
                }
                master->txData = NULL;
            }
        }
    }

    /* Check if transfer is over */
    if (master->rxRemainingBytes == 0U)
    {
        /* Record success if there was no error */
        if (master->status == FLEXIO_STATUS_BUSY)
        {
            master->status = FLEXIO_STATUS_SUCCESS;
        }
        /* End transfer. Use forced stop because timers are set to never disable. */
        FLEXIO_I2S_DRV_MasterStopTransfer(master);
        /* Call callback to announce the event to the user */
        if (master->callback != NULL)
        {
            master->callback(master, FLEXIO_EVENT_END_TRANSFER, master->callbackParam);
        }
        /* Signal transfer end for blocking transfers */
        if (master->blocking == true)
        {
            (void)OSIF_SemaPost(&(master->idleSemaphore));
        }
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterEndDmaTxTransfer
 * Description   : function called at the end of a DMA Tx transfer
 *
 *END**************************************************************************/
static void FLEXIO_I2S_DRV_MasterEndDmaTxTransfer(void *stateStruct, edma_chn_status_t status)
{
    flexio_i2s_master_state_t *master;
    uint8_t dmaChn;
    DMA_Type *edmaBase;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    (void)status;
    master = (flexio_i2s_master_state_t *)stateStruct;

    /* Call callback to allow user to provide a new buffer */
    if (master->callback != NULL)
    {
        master->callback(master, FLEXIO_EVENT_TX_EMPTY, master->callbackParam);
    }
    if (master->txRemainingBytes == 0U)
    {
        /* No more data to transmit, transmission will stop */
        master->txData = NULL;
    }
    else
    {
        /* There is more data to transfer, restart DMA channel */
        /* Update buffer address and size */
        dmaChn = master->txDMAChannel.channel;
        edmaBase = g_edmaBase[0U];
        EDMA_HAL_TCDSetSrcAddr(edmaBase, dmaChn, (uint32_t)(master->txData));
        EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, master->txRemainingBytes / master->byteWidth);
        /* Now that this tx is set up, clear remaining bytes count */
        master->txRemainingBytes = 0U;
        /* Start the channel */
        (void)EDMA_DRV_StartChannel(&(master->txDMAChannel));
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterEndDmaRxTransfer
 * Description   : function called at the end of a DMA Tx transfer
 *
 *END**************************************************************************/
static void FLEXIO_I2S_DRV_MasterEndDmaRxTransfer(void *stateStruct, edma_chn_status_t status)
{
    flexio_i2s_master_state_t *master;
    uint8_t dmaChn;
    DMA_Type *edmaBase;
    uint32_t addr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    (void)status;
    master = (flexio_i2s_master_state_t *)stateStruct;

