abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_i2s_driver.c
    /* If this was a reception, call callback to allow user to provide a new buffer */
    if ((master->rxData != NULL) && (master->callback != NULL))
    {
        master->callback(master, FLEXIO_EVENT_RX_FULL, master->callbackParam);
    }
    if (master->rxRemainingBytes == 0U)
    {
        /* No more data, end transfer */
        master->status = FLEXIO_STATUS_SUCCESS;
        /* End transfer. Use forced stop because timers are set to never disable. */
        FLEXIO_I2S_DRV_MasterStopTransfer(master);
        /* Call callback to announce the event to the user */
        if (master->callback != NULL)
        {
            master->callback(master, FLEXIO_EVENT_END_TRANSFER, master->callbackParam);
        }
        /* Signal transfer end for blocking transfers */
        if (master->blocking == true)
        {
            (void)OSIF_SemaPost(&(master->idleSemaphore));
        }
    }
    else
    {
        /* There is more data to transfer, restart DMA channel */
        /* Update buffer address and size */
        dmaChn = master->rxDMAChannel.channel;
        edmaBase = g_edmaBase[0U];
        if (master->rxData != NULL)
        {
            addr = (uint32_t)(master->rxData);
        }
        else
        {
            /* if there is no data to receive, use dummy data as destination for DMA transfer */
            addr = (uint32_t)(&(master->dummyDmaData));
        }
        EDMA_HAL_TCDSetDestAddr(edmaBase, dmaChn, addr);
        EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, master->rxRemainingBytes / master->byteWidth);
        /* Now that this rx is set up, clear remaining bytes count */
        master->rxRemainingBytes = 0U;
        /* Start the channel */
        (void)EDMA_DRV_StartChannel(&(master->rxDMAChannel));
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterComputeTxRegAddr
 * Description   : Computes the address of the register used for DMA tx transfer
 *
 *END**************************************************************************/
static uint32_t FLEXIO_I2S_DRV_MasterComputeTxRegAddr(flexio_i2s_master_state_t *master)
{
    uint32_t addr;
    FLEXIO_Type *baseAddr;
    uint8_t shifter;

    baseAddr = g_flexioBase[master->flexioCommon.instance];
    shifter = TX_SHIFTER(master->flexioCommon.resourceIndex);
    addr = (uint32_t)(&(baseAddr->SHIFTBUFBIS[shifter])) + (sizeof(uint32_t) - master->byteWidth);
    return addr;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterComputeRxRegAddr
 * Description   : Computes the address of the register used for DMA rx transfer
 *
 *END**************************************************************************/
static uint32_t FLEXIO_I2S_DRV_MasterComputeRxRegAddr(flexio_i2s_master_state_t *master)
{
    uint32_t addr;
    FLEXIO_Type *baseAddr;
    uint8_t shifter;

    baseAddr = g_flexioBase[master->flexioCommon.instance];
    shifter = RX_SHIFTER(master->flexioCommon.resourceIndex);
    addr = (uint32_t)(&(baseAddr->SHIFTBUFBIS[shifter]));
    return addr;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterStartDmaTransfer
 * Description   : Starts a DMA transfer
 *
 *END**************************************************************************/
static flexio_status_t FLEXIO_I2S_DRV_MasterStartDmaTransfer(flexio_i2s_master_state_t *master)
{
    dma_request_source_t dmaReq;
    uint32_t instance;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    uint8_t dmaChn;
    DMA_Type *edmaBase = g_edmaBase[0U];
    FLEXIO_Type *baseAddr;
    uint32_t addr;
    edma_status_t dmaStatus;
    uint8_t requestMask = 0U;

    baseAddr = g_flexioBase[master->flexioCommon.instance];
    resourceIndex = master->flexioCommon.resourceIndex;
    instance = master->flexioCommon.instance;

    /* Configure Tx channel if this is a transmission */
    if (master->txData != NULL)
    {
        /* Request a DMA channel for transmission */
        dmaReq = g_flexioDMASrc[instance][TX_SHIFTER(resourceIndex)];
        dmaStatus = EDMA_DRV_RequestChannel((uint8_t)EDMA_ANY_CHANNEL, dmaReq, &(master->txDMAChannel), &dmaChn);
        if (dmaStatus == EDMA_STATUS_FAIL)
        {
            return FLEXIO_STATUS_FAIL;
        }
        /* Configure the transfer control descriptor for the previously allocated channel */
        (void)EDMA_DRV_ConfigSingleBlockTransfer(&(master->txDMAChannel), 
                                                 EDMA_TRANSFER_MEM2PERIPH, 
                                                 (uint32_t)(master->txData),
                                                 FLEXIO_I2S_DRV_MasterComputeTxRegAddr(master), 
                                                 dmaTransferSize[master->byteWidth - 1U], 
                                                 master->byteWidth);
        EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, master->txRemainingBytes / master->byteWidth);
        EDMA_HAL_TCDSetDisableDmaRequestAfterTCDDoneCmd(edmaBase, dmaChn, true);
        /* Now that this tx is set up, clear remaining bytes count */
        master->txRemainingBytes = 0U;

        /* Setup callback for DMA tx transfer end */
        (void)EDMA_DRV_InstallCallback(&(master->txDMAChannel),
                                       (edma_callback_t)(FLEXIO_I2S_DRV_MasterEndDmaTxTransfer),
                                       (void*)(master));
        /* Start tx DMA channel */
        (void)EDMA_DRV_StartChannel(&(master->txDMAChannel));
        requestMask = 1U << TX_SHIFTER(resourceIndex);
    }
    /* Configure Rx channel; if this is a transmission we still use Rx for the "end transfer" event */
    if (master->rxData != NULL)
    {
        addr = (uint32_t)(master->rxData);
    }
    else
    {
        /* if there is no data to receive, use dummy data as destination for DMA transfer */
        addr = (uint32_t)(&(master->dummyDmaData));
    }
    /* Request a DMA channel for reception */
    dmaReq = g_flexioDMASrc[instance][RX_SHIFTER(resourceIndex)];
    dmaStatus = EDMA_DRV_RequestChannel((uint8_t)EDMA_ANY_CHANNEL, dmaReq, &(master->rxDMAChannel), &dmaChn);
    if (dmaStatus == EDMA_STATUS_FAIL)
    {
        /* Release Tx channel if it was allocated */
        if (master->txData != NULL)
        {
            (void)EDMA_DRV_ReleaseChannel(&(master->txDMAChannel));
        }
        return FLEXIO_STATUS_FAIL;
    }
    /* Configure the transfer control descriptor for the previously allocated channel */
    (void)EDMA_DRV_ConfigSingleBlockTransfer(&(master->rxDMAChannel), 
                                             EDMA_TRANSFER_PERIPH2MEM, 
                                             FLEXIO_I2S_DRV_MasterComputeRxRegAddr(master), 
                                             addr,
                                             dmaTransferSize[master->byteWidth - 1U], 
                                             master->byteWidth);
    if (master->rxData == NULL)
    {
        /* if there is no data to receive, don't increment destination offset */
        EDMA_HAL_TCDSetDestOffset(edmaBase, dmaChn, 0);
    }
    EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, master->rxRemainingBytes / master->byteWidth);
    EDMA_HAL_TCDSetDisableDmaRequestAfterTCDDoneCmd(edmaBase, dmaChn, true);
    /* Now that this rx is set up, clear remaining bytes count */
    master->rxRemainingBytes = 0U;

    /* Setup callback for DMA rx transfer end */
    (void)EDMA_DRV_InstallCallback(&(master->rxDMAChannel),
                                   (edma_callback_t)(FLEXIO_I2S_DRV_MasterEndDmaRxTransfer),
                                   (void*)(master));
    /* Start rx DMA channel */
    (void)EDMA_DRV_StartChannel(&(master->rxDMAChannel));
    requestMask |= 1U << RX_SHIFTER(resourceIndex);

