abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_i2s_driver.c
    /* Enable FlexIO DMA requests */
    FLEXIO_HAL_SetShifterDMARequest(baseAddr, requestMask, true);

    return FLEXIO_STATUS_SUCCESS;
}

/*! @endcond */

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterInit
 * Description   : Initialize the FLEXIO_I2S master mode driver
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterInit(uint32_t instance,
                                          const flexio_i2s_master_user_config_t * userConfigPtr,
                                          flexio_i2s_master_state_t * master)
{
    uint32_t inputClock;
    clock_manager_error_code_t clkErr;
    flexio_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    /* Check that device was initialized */
    DEV_ASSERT(g_flexioDeviceStatePtr[instance] != NULL);
#endif

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_STATUS_FAIL;
    }

    /* Initialize the semaphore */
    if (OSIF_SemaCreate(&(master->idleSemaphore), 0U) == OSIF_STATUS_FAIL)
    {
        return FLEXIO_STATUS_FAIL;
    }

    /* Instruct the resource allocator that we need two shifters/timers */
    master->flexioCommon.resourceCount = 2U;
    /* Common FlexIO driver initialization */
    retCode = FLEXIO_DRV_InitDriver(instance, (flexio_common_state_t *)master);
    if (retCode != FLEXIO_STATUS_SUCCESS)
    {   /* Initialization failed, not enough resources */
        (void)OSIF_SemaDestroy(&(master->idleSemaphore));
        return retCode;
    }

    /* Initialize driver-specific context structure */
    master->driverType = userConfigPtr->driverType;
    master->bitsWidth = userConfigPtr->bitsWidth;
    master->byteWidth = FLEXIO_I2S_DRV_ComputeByteWidth(userConfigPtr->bitsWidth);
    master->driverIdle = true;
    master->callback = userConfigPtr->callback;
    master->callbackParam = userConfigPtr->callbackParam;
    master->blocking = false;
    master->txData = NULL;
    master->txRemainingBytes = 0U;
    master->rxData = NULL;
    master->rxRemainingBytes = 0U;
    master->master = true;
    master->status = FLEXIO_STATUS_SUCCESS;

    /* Configure device for I2S mode */
    FLEXIO_I2S_DRV_MasterConfigure(master, userConfigPtr, inputClock);

    /* Set up transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            master->flexioCommon.isr = FLEXIO_I2S_DRV_MasterCheckStatus;
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_I2S_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            /* Nothing to do here, DMA channels are allocated when a transfer is initiated */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterDeinit
 * Description   : De-initialize the FLEXIO_I2S master mode driver
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterDeinit(flexio_i2s_master_state_t *master)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
#endif

    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }

    /* Destroy the semaphore */
    (void)OSIF_SemaDestroy(&(master->idleSemaphore));

    return FLEXIO_DRV_DeinitDriver((flexio_common_state_t *)master);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterSetConfig
 * Description   : Set the baud rate and bit width for any subsequent I2S transfer
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterSetConfig(flexio_i2s_master_state_t * master, 
                                               uint32_t baudRate, 
                                               uint8_t bitsWidth)
{
    FLEXIO_Type *baseAddr;
    uint16_t divider;
    uint32_t inputClock;
    clock_manager_error_code_t clkErr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(bitsWidth <= 32U);
    /* for DMA transfers bitsWidth must 8, 16, or 32 */
    DEV_ASSERT(!((master->driverType == FLEXIO_DRIVER_TYPE_DMA) && 
                 (bitsWidth != 8U) && (bitsWidth != 16U) && (bitsWidth != 32U)
                ));
#endif

    baseAddr = g_flexioBase[master->flexioCommon.instance];
    resourceIndex = master->flexioCommon.resourceIndex;

    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }
    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[master->flexioCommon.instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_STATUS_FAIL;
    }

    /* Compute divider */
    FLEXIO_I2S_DRV_MasterComputeBaudRateDivider(master, baudRate, &divider, inputClock);

    /* Configure SCK timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER(resourceIndex), (((bitsWidth << 1U) - 1U) << 8U) + divider);
    /* Configure WS timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, WS_TIMER(resourceIndex), bitsWidth * ((divider + 1U) * 2U) - 1U);

    master->bitsWidth = bitsWidth;
    master->byteWidth = FLEXIO_I2S_DRV_ComputeByteWidth(bitsWidth);

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterGetBaudRate
 * Description   : Get the currently configured baud rate
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterGetBaudRate(flexio_i2s_master_state_t *master, uint32_t *baudRate)
{
    FLEXIO_Type *baseAddr;
    uint32_t inputClock;
    uint32_t divider;
    uint16_t timerCmp;
    clock_manager_error_code_t clkErr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
#endif

