abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_i2s_driver.c
    /* Check if driver is busy */
    if (master->driverIdle)
    {
        return FLEXIO_STATUS_FAIL;
    }

    master->status = FLEXIO_STATUS_ABORTED;
    FLEXIO_I2S_DRV_MasterStopTransfer(master);

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterGetStatus
 * Description   : Get the status of the current non-blocking I2S master transaction
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterGetStatus(flexio_i2s_master_state_t *master, uint32_t *bytesRemaining)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
#endif

    if ((!master->driverIdle) && (master->driverType == FLEXIO_DRIVER_TYPE_POLLING))
    {
        /* In polling mode advance the I2S transfer here */
        FLEXIO_I2S_DRV_MasterCheckStatus(master);
    }

    if (bytesRemaining != NULL)
    {
        /* Use rxRemainingBytes even for transmit; byte is not transmitted 
           until rx shifter reports a receive event */
        *bytesRemaining = master->rxRemainingBytes;
    }

    if (!master->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }
    else
    {
        return master->status;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterSetRxBuffer
 * Description   : Provide a buffer for receiving data.
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterSetRxBuffer(flexio_i2s_master_state_t *master,
                                                 uint8_t * rxBuff,
                                                 uint32_t rxSize)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0U);
#endif
    master->rxData = rxBuff;
    master->rxRemainingBytes = rxSize;

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_MasterSetTxBuffer
 * Description   : Provide a buffer for transmitting data.
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_MasterSetTxBuffer(flexio_i2s_master_state_t *master,
                                                 uint8_t * txBuff,
                                                 uint32_t txSize)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(txSize > 0U);
#endif
    master->txData = txBuff;
    master->txRemainingBytes = txSize;
    /* for transmit we also count received bytes for end condition */
    master->rxRemainingBytes += txSize;

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_SlaveInit
 * Description   : Initialize the FLEXIO_I2S slave mode driver
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_SlaveInit(uint32_t instance,
                                          const flexio_i2s_slave_user_config_t * userConfigPtr,
                                          flexio_i2s_slave_state_t * slave)
{
    flexio_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(slave != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    /* Check that device was initialized */
    DEV_ASSERT(g_flexioDeviceStatePtr[instance] != NULL);
#endif

    /* Initialize the semaphore */
    if (OSIF_SemaCreate(&(slave->idleSemaphore), 0U) == OSIF_STATUS_FAIL)
    {
        return FLEXIO_STATUS_FAIL;
    }

    /* Instruct the resource allocator that we need two shifters/timers */
    slave->flexioCommon.resourceCount = 2U;
    /* Common FlexIO driver initialization */
    retCode = FLEXIO_DRV_InitDriver(instance, (flexio_common_state_t *)slave);
    if (retCode != FLEXIO_STATUS_SUCCESS)
    {   /* Initialization failed, not enough resources */
        (void)OSIF_SemaDestroy(&(slave->idleSemaphore));
        return retCode;
    }

    /* Initialize driver-specific context structure */
    slave->driverType = userConfigPtr->driverType;
    slave->bitsWidth = userConfigPtr->bitsWidth;
    slave->byteWidth = FLEXIO_I2S_DRV_ComputeByteWidth(userConfigPtr->bitsWidth);
    slave->driverIdle = true;
    slave->callback = userConfigPtr->callback;
    slave->callbackParam = userConfigPtr->callbackParam;
    slave->blocking = false;
    slave->txData = NULL;
    slave->txRemainingBytes = 0U;
    slave->rxData = NULL;
    slave->rxRemainingBytes = 0U;
    slave->master = false;
    slave->status = FLEXIO_STATUS_SUCCESS;

    /* Configure device for I2S mode */
    FLEXIO_I2S_DRV_SlaveConfigure(slave, userConfigPtr);

    /* Set up transfer engine */
    switch (slave->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            slave->flexioCommon.isr = FLEXIO_I2S_DRV_MasterCheckStatus;
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_I2S_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            /* Nothing to do here, DMA channels are allocated when a transfer is initiated */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2S_DRV_SlaveSetConfig
 * Description   : Set the baud rate and bit width for any subsequent I2S transfer
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_I2S_DRV_SlaveSetConfig(flexio_i2s_slave_state_t * slave, 
                                               uint8_t bitsWidth)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(slave != NULL);
    DEV_ASSERT(bitsWidth <= 32U);
    /* for DMA transfers bitsWidth must 8, 16, or 32 */
    DEV_ASSERT(!((slave->driverType == FLEXIO_DRIVER_TYPE_DMA) && 
                 (bitsWidth != 8U) && (bitsWidth != 16U) && (bitsWidth != 32U)
                ));
#endif

    baseAddr = g_flexioBase[slave->flexioCommon.instance];
    resourceIndex = slave->flexioCommon.resourceIndex;

    /* Check if driver is busy */
    if (!slave->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }

    slave->bitsWidth = bitsWidth;
    slave->byteWidth = FLEXIO_I2S_DRV_ComputeByteWidth(bitsWidth);

    /* Configure SCK timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER(resourceIndex), (bitsWidth << 2U) - 3U);
    /* Configure WS timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, WS_TIMER(resourceIndex), (bitsWidth << 1U) - 1U);

    return FLEXIO_STATUS_SUCCESS;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/
